app/Models/RegisterModel.php

    public function verifyEmail($email){
        $builder = $this->db->table('users');
        $builder->select("id,email,password");
        $builder->where('email', $email);

        $result = $builder->get();
---
SELECT `id`, `email`, `password`
FROM `users`
WHERE `email` = 'vp@gmail.com'